__load_test__/first-test.yml
config:
  # target: 'http://localhost:3000'
  phases:
    - duration: 5
      arrivalRate: 5
    - duration: 10 # five seconds
      arrivalRate: 20 # 20 fake users per second
  processor: './load-test-create-user.js'
scenarios:
  - name: "Create Users"
    flow:
    - function: 'create'
    - post:
        url: "/signup"
        json:
          username: "{{ username }}"
          email: "{{ email }}"
          password: "{{ password }}"
        capture:
          json: "$.token"
          as: "token"
    - log: "Sent a request to signup/"