__load_test__/simple-load-test.yml
config:
  target: 'http://localhost:3000'
  phases:
    - duration: 5
      arrivalRate: 20
    - duration: 10
      arrivalRate: 50
    - duration: 5
      arrivalRate: 400
  processor: './load-test-create-user.js'
scenarios:
  - name: "Create Users"
    flow:
    - function: 'create'
    - post:
        url: "/signup"
        json:
          username: "{{ username }}"
          email: "{{ email }}"
          password: "{{ password }}"
        capture:
          json: "$.token"
          as: "token"
    - log: "Sent a request to signup/"
    - get:
        url: "/user/me"
        headers:
          Authorization: "Bearer {{ token }}"
    - log: "sent a request to /user/me"